[
  {
    "trigger": "main-panel",
    "title": "Main panel",
    "pages": [
      {
        "text": "Townforge is a blockchain-based game, with a consensus-driven peer-to-peer network. While most online multiplayer games revolve around a central server, Townforge relies on peers relying on peers communicating current game state via the highest blockchain. Game actions are mined as transactions into the Townforge blockchain, and miners who discover these blocks are rewarded with Townforge Gold.\nIn order to play the game, you need to run the Townforge daemon (executable townforged). Running this separately from the main executable (townforge) allows you to interact with the daemon, but the main game client will automatically launch the daemon for you. After this you need to connect to other peers to stay connected to the game. To this end, we provide seeding nodes that try to help new nodes discover other peers in the network.\nYour game wallet is a file connected to your in-game account and can only be recovered using your seed words, so store these keywords properly. After entrance fee of 1 TFG or an invitation code from an another player you can create your in-game account. Please note that due to the decentralized nature of the game, such accounts can never be redeemed if lost. Once your in-game account is created, youre synced up to the Townforge network block height, and the game client is running, youre ready to play Townforge!",
        "image": "Tutorial/tutorial_page1_quickstart.png"
      },
      {
        "text": "Land and its ownership is a key concept in economical gameplay in Townforge. The world is discretized into grid coordinates (little squares), which then follow a height-map for bringing variety into the landscape. Further, land has the following characteristics that affect buildings on it:\n- Location in relation to town center (central land has higher tax and initial purchase price)\n- Height and steepness (higher elevation or mountainy terrain yield bonuses to stone production)\n- Stability (lower building decay)\n- Geothermal heating (lesser warming material requirements for all building types and bonuses to agricultural yield)\n- Agricultural potential (bonuses to agricultural yields)\n- Stone and wood type and quantity (bonuses to respective production buildings for quality and quantity, respectively)\n- Gemstone veins (yield a chance to finding rare prestigious gemstones via stonecutters)\n\nPurchasing land\n\nLand can be purchased by selecting free rectangular selection. Smallest allowed lot size is 10x10, while higher Economical Power buildings or certain building types may have additional requirements; for example, agricultural lots are required to be larger than other building types. Largest possible lot size is 256x256\nIf the player possesses the required amount of gold to purchase the land and the selected area does not overlap with existing lots, player may push a land purchase transaction into the Townforge transaction pool. After the purchase goes through, the paid amount is transferred to the city treasury and the player is given right to the land. Raw lots do not yet have an effect on gameplay, and player has to type a building to lots. Positioning lots to suitable locations and near other buildings that yield good bonuses is part of the strategic and profitable gameplay.\nLots can be sold, auctioned, or mortgaged. Some actions require lots to be be non-typed in order to do such actions. Land tax will also apply to non-typed lots, requiring a recurring payment to the town for owning said land.",
        "image": "Tutorial/tutorial_page2_land.png"
      },
      {
        "text": "Research refers to the discovery of technological advancements in the Townforge network.\nA predefined list of tech, difficulty, dependency tree and their specific effects exist upon launch. New tech is discovered by investing money, and the larger the invested amount of gold in comparison with the target the higher the change of discovery. This is a one time attempt, and if the random chance fails, the gold is lost. With a successful attempt, the player is given 10 copies of an exclusive patent to that discovered tech. Everybody with a copy of such a patent gains its corresponding techs advantages. Patents can be sold on the player markets like any other items. After a fixed time period (in terms of a block count) the patents expire and the tech becomes globally available to all players.\nExamples of tech advantages include:\n- Increased amount of shared generated by a specific building type\n- Increased yield for food in farming or hunting\n- Decreased building decay or increased yield in redeemed building materials upon lot demolition\n- Prevention against disasters (earthquake, vermin, ...)\n- Access to increased Economical Power buildings\n- Prerequirement techs that open access to other downstream technologies",
        "image": "Tutorial/tutorial_page3_research.png"
      }
    ]
  }
]
