[
  {
    "trigger": "startup",
    "title": "Tutorial Compendium",
    "pages": [
      {
        "name": "Overview",
        "text": "Welcome to Townforge, settler!\n\nTownforge is a blockchain-based game, with a consensus-driven peer-to-peer network.\nWhile most online multiplayer games revolve around a central server, Townforge relies on peers relying on peers communicating current game state via the highest blockchain.\nGame actions are mined as transactions into the Townforge blockchain, and miners who discover these blocks are rewarded with Townforge Gold.\n\nIn order to play the game, you need to run the Townforge daemon (executable townforged).\nRunning this separately from the main executable (townforge) allows you to interact with the daemon, but the main game client will automatically launch the daemon for you.\nAfter this you need to connect to other peers to stay connected to the game.\nTo this end, we provide seeding nodes that try to help new nodes discover other peers in the network.\n\nYour game wallet is a file connected to your in-game account and can only be recovered using your seed words, so store these keywords properly.\nAfter entrance fee of 1 TFG or an invitation code from an another player you can create your in-game account.\nPlease note that due to the decentralized nature of the game, such accounts can never be redeemed if lost.\nOnce your in-game account is created, you are synced up to the Townforge network block height, and the game client is running, you are ready to play Townforge!",
        "image": "Tutorial/tutorial_page1_quickstart.png"
      },
      {
        "name": "Land",
        "text": "Land and its ownership is a key concept in economical gameplay in Townforge.\nThe world is discretized into grid coordinates (little squares), which then follow a height-map for bringing variety into the landscape.\nFurther, land has the following characteristics that affect buildings on it:\n- Location in relation to town center (central land has higher tax and initial purchase price)\n- Height and steepness (higher elevation or mountainy terrain yield bonuses to stone production)\n- Stability (lower building decay)\n- Geothermal heating (lesser warming material requirements for all building types and bonuses to agricultural yield)\n- Agricultural potential (bonuses to agricultural yields)\n- Stone and wood type and quantity (bonuses to respective production buildings for quality and quantity, respectively)\n- Gemstone veins (yield a chance to finding rare prestigious gemstones via stonecutters)\n\nPurchasing land\n\nLand can be purchased by selecting free rectangular selection.\nSmallest allowed lot size is 10x10, while higher Economical Power buildings or certain building types may have additional requirements;\nfor example, agricultural lots are required to be larger than other building types.\nLargest possible lot size is 256x256\nIf the player possesses the required amount of gold to purchase the land and the selected area does not overlap with existing lots, player may push a land purchase transaction into the Townforge transaction pool.\nAfter the purchase goes through, the paid amount is transferred to the city treasury and the player is given right to the land.\nRaw lots do not yet have an effect on gameplay (other than land tax), and player has to type the lots to specific building types.\nPositioning lots to suitable locations and near other buildings that yield good bonuses is part of the strategic and profitable gameplay.\n\nLots can be sold, auctioned, or mortgaged.\nSome actions require lots to be be non-typed in order to do such actions.\nLand tax will also apply to non-typed lots, requiring a recurring payment to the town for owning said land.",
        "image": "Tutorial/tutorial_page2_land.png"
      },      
      {
        "name": "Research",
        "text": "Research refers to the discovery of technological advancements in the Townforge network.\n\nA predefined list of tech, difficulty, dependency tree and their specific effects exist upon launch.\nNew tech is discovered by investing money, and the larger the invested amount of gold in comparison with the target the higher the change of discovery.\nThis is a one time attempt, and if the random chance fails, the gold is lost.\nWith a successful attempt, the player is given 10 copies of an exclusive patent to that discovered tech.\nEverybody with a copy of such a patent gains its corresponding techs advantages.\nPatents can be sold on the player markets like any other items.\nAfter a fixed time period (in terms of a block count) the patents expire and the tech becomes globally available to all players.\n\nExamples of tech advantages include:\n- Increased amount of shared generated by a specific building type\n- Increased yield for food in farming or hunting\n- Decreased building decay or increased yield in redeemed building materials upon lot demolition\n- Prevention against disasters (earthquake, vermin, ...)\n- Access to increased Economical Power buildings\n- Prerequirement techs that open access to other downstream technologies",
        "image": "Tutorial/tutorial_page3_research.png"
      },
      {
        "name": "Time",
        "text": "Progression via the blockchain\n\nGame progression in Townforge happens as blocks are mined and appended to Townforge blockchain.\nAll game actions are stored inside the blockchain, thus block discovery is essential for game progression.\n\nThe Townforge consensus network adjusts the mining difficulty so that the target discovery rate for blocks is one per 30 seconds.\nThis means that on average new game actions take place over the network twice per minute and are appended to the blockchain.\n\nGame is split into two progression steps:\n\n1) Game updates per block;\nThese occur every block, and include resolving:\n- Depositing or withdrawing Townforge gold between the in-game and out-game wallet\n- Appending building commands adding or removing voxels into buildings\n- Resolving market orders (buy or sell)\n- Resolving land purchases or lot reshaping\n- Hunting, sowing, and harvesting\n- Collectible item related actions\n- Research and discoveries\n\n2) Game ticks;\nThese occur every 720 blocks (every 6 hours, 4 times a day on average), and include resolving heavier game logic:\n- Paying out subsidies from city treasuries\n- Activating or inactivating buildings\n- Consuming food and firewood and have buildings decay\n- Awarding badges and levels\n- The hunting-related quantities are updated (i.e. amount of moose and bear)\n\nThe game composes of seasons as a combination of a subseason (early, mid, or late) and its corresponding real world season (summer, fall, winter, autumn).\nThese months are then divided into 28 Townforge days, for an accurate in-game representation of current in-game date.\nA whole Townforge year corresponds to a real-world week, thus, the cyclic nature of the game starts over every real-life week.\nWith the onset of a new year, following occur:\n- Minting of new collectible year coins\n- Random events, pre-scripted or GM-driven events\n- The sowing and harvesting cycle resets",
        "image": "Tutorial/tutorial_page4_time.png"
      },
      {
        "name": "Food",
        "text": "Holding enough food for game ticks is essential for keeping player buildings active.\nIf a player runs out of food, their buildings are inactivated, making them unable to collect subsidies.\nFood spoils every game tick, with varying decay rates for vegetables, grain, meat, or salted meat.\nThere are two main mechanics for obtaining food, apart from buying it from the markets:\n\n1) Hunting:\nHunting is an event where player expends labour to send out a hunting party. Depending on the active citys animal population properties as well players researched tech, the amount of required labour and expected outcome of gathered meat varies.\nThere are two main animals to hunt whose population slowly repopulate: moose and bear.\n\n2) Farming:\nFarming of vegetables and grain requires player to:\n- Sow the desired food type during their respective seasons using labour\n- Harvest the desired food type during the harvest season, with increasing yield as time progresses enhanced by additional factors such as favorable weather (temperature), researched tech, and random events.\n\nIf a player does not harvest a sown crop during the harvesting period, the crop is lost.\nFarming requires a lot allocated to agriculture-type.\nThese agricultural buildings can be used for planting vegetables or grain, and their properties - such as economic power and size - determine the maximum yield of farmed food.",
        "image": "Tutorial/tutorial_page5_food.png"
      },
      {
        "name": "Economy",
        "text": "Townforge employs a circular in-game economy.\nThe game account takes a small cut of the mined TFG (as of version v0.29 this has been fixed at 0.25% of mined currency), which is intended to fund the devs as well as to be used for in-game events.\nRest of the money spent in game is either transferred between players, or paid as land tax, land purchases, or baseline supply purchases into town treasuries.\nTown treasuries emit their coffins back to players based on subsidies, which are distributed according to shares that players generate with their functional lots with buildings on them.\n\nA baseline supply of essential goods to produce buildings are provided at a high price.\nThese materials include pine, oak and teak for wood materials (also used for heating in addition to building new buildings and repairing existing ones) as well as sandstone, granite and marble (for stone materials).\nThe former are produced by sawmills and latter by stonecutters while consuming labour, food, and warmth in the process.\n\nIncome\nProduction buildings such as stonecutters, sawmills and workforce aim to provide markets with player-driven markets as a means of making money. Baseline infinite supply provides most goods at a high price, which is intended to be easily under-cut by players producing said goods.\nSome goods, such as food, are not available in baseline supply - these have to be produced via agriculture or hunting, and can be sold to other players.\nThe shares generated by buildings generate shares to players which make them eligible to subsidies from town treasuries at each game tick.\nThe following building types generate shares, and their proportion of town treasury omission is indicated with the percentage:\n- Craft (1.2%)\n- Industrial (1.5%)\n- Commercial (1.5%)\n- Basic residential (1.2%)\n- Affluent residential (1.2%)\n- Luxury residential (1.5%)\n- Roads (0.8%)\nLastly, prestige is a means of gaining money back via subsidies and the proportion of game subsidies going to prestige payouts is 0.5%. Prestige is generated by collectibles (such as mintable coins) or gemstones and subsidies are distributed proportional to players current prestige.\n\nExpenses\nFirst expense each player goes through is the 1 TFG investment in creating a game account - this is to prevent account spamming.\nMost players will seek to buy land, which is purchased from cities, and the cost is proportional to the size of the lot as well as its location in relation to the town center (with central being more expensive land).\nLots require land tax payments to city treasury at each game tick, and after the lot has a building on it, the building consumes food and warmth as upkeep.\nSome buildings (e.g. production buildings) will require specific goods to stay active, for example labour.\nMinting coins requires embedding TFG to the coins, but will yield back prestige subsidies.\nFurthermore player-engaged scripts and roleplaying will require and reward in-game goods, including custom player-created items or possibly NFTs.",
        "image": "Tutorial/tutorial_page6_economy.png"        
      },
      {
        "name": "Influence",
        "text": "Influence is a game mechanic related to game lots.\nInfluence is determined as a radius using the Manhattan distance (absolute coordinate axes), which is increased for larger lots or lots with larger economical power.\nBeing within the influence range of a previous tier building is a requirement for some higher tier buildings, and typically influence results in a bonus modified to the shares generated by a typed lot.\nIn some rare scenarios - such as with military buildings - the influence may incur negative modifiers.\nAn influence area from an another lot must cover 50% or more of an affected lot in order to apply to it.\n\nRoads are an exception in their influence, as their share bonus is substantially higher, but their influence range is always 1 regardless of road size or road EP.The influence range of a lot is indicated - by default - with cyan diamonds on the map.",
        "image": "Tutorial/tutorial_page7_influence.png"
      },
      {
        "name": "Buildings",
        "text": "Buildings refer to lots that have been typed.\nBuildings can be of various types: agriculture, residential, crafts, etc.\nSome serve production purposes, such as agriculture, sawmills, and stonecutters.\nOthers are share-generators making player eligible to collect city treasury subsidies.\n\nGame mechanics -wise buildings can be split into two parts:\n\n1) Game logic buildings:\nOnce the minimum amount of materials have been allocated to a suitable lot and the transaction has been mined to type a lot, the lot becomes a building.\nThe building can be active or inactive, and they always start inactive.\nIf the conditions are filled (food, warmth, other materials, and coverage via influence by required buildings), the next game click will activate the building and it will start operating in the game logic.\nAs buildings stay active, they keep rewarding players via subsidies or their production capacity.\nRegardless of their activity status, buildings will continue to decay and the lot will continue to require land tax.\nFor these buildings, their aesthetic outlook has no significance.\n\n2) Aesthetic buildings:\nThe second part of buildings in Townforge are the aesthetic voxel-based buildings.\nEssentially a visually empty lot can be a game logic building.\nHowever, when a lot is typed to a building, a minimum set of materials is always allocated to the lot.\nThese materials - such as sandstone and pine wood - can be placed using different textures unlocked via player levels to create aesthetic voxel-based buildings.\nPlayers are free to allocate further materials to the lots beyond the minimum requirements, but these will only serve aesthetic purposes, and will not improve the game logic performance of the building.\nTownforge is dedicated to encourage aesthetic building, and this will be reflected on events intended for players.",
        "image": "Tutorial/tutorial_page8_buildings.png"
      }
    ]
  }
]
