[
  {
    "name": "startup_tutorial",
    "trigger": "startup",
    "title": "Tutorial Compendium",
    "pages": [
      {
      	"name": "welcome",
        "text": "Welcome to Townforge, a blockchain based Norse themed emergent city simulator, with embedded RPG elements.\n\nPress >> below for an overview and quick start guide to key game mechanics, or Done to play the game right now.\nYou can always review any tutorial screen later from the options screen.",
        "image": "Tutorial/tutorial_startup_welcome.png"
      },
      {
      	"name": "blockchain",
      	"text": "Townforge runs on a heavily modified fork of the cryptocurrency Monero. This means Townforge is decentralized, and the game is distributed among a network of peers, and all game actions are appended to the game blockchain based on consensus rules upon block discovery. The game aims to find new blocks every 30 seconds, meaning the game state progresses - on average - every 30 seconds.",
      	"image": "Tutorial/tutorial_startup_blockchain.png"
      },
      {
      	"name": "crypto",
      	"text": "Townforge implements its own cryptocurrency, Townforge Gold (TFG). TFG is used as main means for in-game transactions, and it can be obtained by mining blocks to the blockchain, purchasing from other players or miners, or via in-game actions such as town treasury payouts.",
      	"image": "Tutorial/tutorial_startup_crypto.png"      	
      },
      {
      	"name": "wallet",
      	"text": "In order to play, you need to create a wallet or load an existing one. This wallet is essentially your means to accessing your in-game account. Please note that due to the decentralized nature of Townforge, if you lose your wallet access, nobody can recover it for you - due to this it is essential to keep the walle secure and store its 16 word recovery mnemonic seed, preferably at a secure physical location.",
      	"image": "Tutorial/tutorial_startup_wallet.png"
      },
      {
      	"name": "concepts",
      	"text": "It is important to understand that playing Townforge essentially consists of: the daemon, the Townforge network, and the game client. \n\n1) The daemon is your connection to the Townforge network - it will broadcast your commands, and receive current game state. \n2) The network is governed by consensus rules, that keep track that new appended blocks to the blockchains contain commands that adhere to Townforge rules. \n3) Finally, the default game client uses the open source Urho3D engine - but as an open source project, you could use any non-official client or even create your very own!",
      	"image": "Tutorial/tutorial_startup_concepts.png"
      },
      {
      	"name": "gameplay1",
      	"text": "The persistent world of Townforge is loosely based on Norse lore, but there is no single correct way to play. You can become a city building mogul, a fervent role player, an architect, an in-game market manipulating bull, a share driven research-enterprise, and much more. The game is designed with emergence both mechanistically and aesthetically, with players driving the development of the Townforge world.",
      	"image": "Tutorial/tutorial_startup_gameplay1.png"
      },
      {
      	"name": "gameplay2",
      	"text": "In the default game client, the main UI panel is located on the top-right corner, with ESC opening up the options. Movement happens with standard WASD-style movement, with holding right mouse button to drag camera direction. The arrow keys can be alternatively used for moving the camera. Shift will accelerate the speed of movement and rotation. Left mouse button is used for selecting terrain and blocks and interacting with the UI. Finally, buttons Q, E, Z, and C are advanced buttons in building voxels, and X is used for material selection.",
      	"image": "Tutorial/placeholder_256x512.png"
      },
      {
      	"name": "gameplay3",
      	"text": "The main game panel opens from top-right corner of the game screen contains all the accessible actions. Depending your current status (such as selected terrain), various options are greyed out or available - for example, purchasing land is available when player has a rectangular selection activated on the game terrain.",
      	"image": "Tutorial/placeholder_128x128.png"
      },
      {
      	"name": "time",
      	"text": "All game actions are stored in blocks in the blockchain. These blocks that contain the game transactions are automatically set so that on average every 30 seconds a new block is appended to the blockchain. Hence, the game progresses in short bumps. In addition to individual game blocks advancing the game state, every 720th block is a special game tick, during which heavier game logic is resolved and heavier game logic is processed.",
      	"image": "Tutorial/placeholder_128x128.png"
      }
    ]
  },
  {
    "name": "basic_ui_calendar",
    "trigger": "ui_calendar",
    "title": "Townforge Calendar",
    "pages": [
      {
        "name": "Calendar wheel",
        "text": "Townforge cycle is split into 4 seasons, which further split into game ticks (shown as the lines on the outer rim of the calendar wheel). The green outer rim portions indicates vegetable sowing and harvesting and brown indicates grain sowing and harvesting seasons. Intuitively, sowing happens in the spring, while harvesting more towards the summer and fall. The thick black line indicates discrete time progression for lighter logic when blocks are discovered, while the game ticks result in heavier game progression calculations.",
        "image": "Tutorial/tutorial_basic_ui_calendar.png"
      },
      {
        "name": "Temperature and details",
        "text": "Temperature changes as a function of the seasons, affecting crops and in-game events. Further, as in-game time progresses via blocks discovered to the blockchain, certain game conditions, such as year-specific runic cycle mintable coins or time-limited story scripts, unlock and progress.",
        "image": "Tutorial/tutorial_basic_ui_calendar2.png"
      },
      {
        "name": "Annual calendar",
        "text": "The annual Townforge consists of 4 seasons, each split into 3 stages (early, middle and late), creating 12 months. Each month is then further split into days for clarity. \n\nEach game tick is 720 blocks, and each real-life day consists of 4 game ticks. A full annual in-game cycle 720*4*7 = 20160 blocks, with an average block discovery time of 30 seconds."
      }
    ]
  },
  {
    "name": "basic_ui_compass",
    "trigger": "ui_compass",
    "title": "Compass and Coordinates",
    "pages": [
      {
        "name": "Compass",
        "text": "For core Townforge game mechanics, the most important coordinates are the x and y coordinates. You can see the North (N) direction by aligning the red pointer towards N. The Z-axis is mainly used for aesthetic building purposes, while the X- and Y-axes impact game mechanics such as lot locations, reach to affect other lots, distance from town center etc.",
        "image": "Tutorial/tutorial_basic_ui_compass.png"
      },
      {
        "name": "Coordinates",
        "text": "The coordinate system relying on x and y coordinates determine e.g. land heightmap, its properties such as fertility, price, and potential bonuses for various building types. All selections done with mouse highlight a shape on the {x,y}-plane, which can be used for land purchases, placing voxels for aesthetic building, etc.",
        "image": "Tutorial/tutorial_basic_ui_coordinates.png"
      }
    ]
  },
  {
    "name": "basic_ui_player",
    "trigger": "ui_player",
    "title": "Player info",
    "pages": [
      {
        "name": "Player",
        "text": "Basic player information is tied to an out-of-game wallet. The player info tab shows current in-game balannce (public) as well as out-of-game balance (private). As player account is tied to a wallet file, this is essentially the login method to the game. \n\nFurther player-specific information can be opened by pressing the ?-symbol for more details; these further details contain for example the item inventory, bio, discoveries, level, attributres, and achievements by the player. It is important to understand that all this in-game information is public to other Townforge players at all times.",
        "image": "Tutorial/tutorial_basic_ui_player.png"
      },
      {
        "name": "Wallet",
        "text": "Upon starting the game, player is prompted to create a wallet file. Alternatively, an existing wallet file can be created. A wallet exists out of game, and will require 1 Townforge gold deposit to create an in-game account tied to it. The wallet files end in suffix .keys; additionally, a cache file without a suffix is created, and for troublehooting purposes deletion of this file may sometimes be necessary. \n\nTake good care of your wallet file, as it is a key component of your authentication!",
        "image": "Tutorial/tutorial_basic_ui_wallet.png"
      }
    ]
  },
  {
    "name": "basic_ui_node",
    "trigger": "ui_node",
    "title": "Townforge node",
    "pages": [
      {
        "name": "Node",
        "text": "In order to play Townforge, you need to have an up-to-date blockchain, since it stores all game actions and appends new actions to it as they mined as blocks. In order to have a fully functional game, make sure to be fully synced to the network. Due to the decentralized nature of Townforge, you may sometimes find disconnected from the main blockchain, which may result in loss of game actions or even spurious game state. As the expected block discovery is 30 seconds, you can keep track of approximate block height the current game ought to be at.",
        "image": "Tutorial/tutorial_basic_ui_node.png"
      },
      {
        "name": "Mining and daemon",
        "text": "Solving computational problems for appending new blocks to the blockchain is called mining, and this is highly encouraged. Townforge ought to be launched together with its daemon, which handles communication with the rest of the network, but also allows mining. Mining is optional however, as it can computationally intensive. Townforge supports merge-mining with the prominent privacy coin Monero, and merge-mining both strengthens both networks and makes the miner eligible for rewards from cryptocurrencies.\n\nThe daemon launches by default if Townforge main executable detects that it is not running, but it is possible to disable this from the options and run e.g. a custom remote node.",
        "image": "Tutorial/tutorial_basic_ui_mining.png"
      }
    ]
  },
  {
    "name": "basic_ui_commands",
    "trigger": "ui_commands",
    "title": "Townforge Commands",
    "pages": [
      {
        "name": "",
        "text": "",
        "image": ""
      },
      {
        "name": "",
        "text": "",
        "image": ""
      }
    ]
  },
  {
    "name": "basic_ui_build",
    "trigger": "ui_build",
    "title": "Building",
    "pages": [
      {
        "name": "Lot purchase",
        "text": "In order to create functional buildings, the player must purchase land from a city of interest. The purchased lots may not overlap with existing lots and the player must have enough money to purchase the land. Keep in mind that owning the land will immediately start requiring land tax, even if there is no building on the lot. Lots may be reshaped, sold, and auctioned, with some limitations applying after a lot has been typed to a building type.",
        "image": "Tutorial/tutorial_basic_ui_landpurchase.png"
      },
      {
        "name": "Building typing",
        "text": "In order to make use of land, it has to be typed. This involves choosing a building type (such as agricultural, residential, crafts, etc), and its economical power (EP). EP will scale the building up in its shares or products, but require more expensive materials. After choosing the building type and EP, and if the required material needs can be fulfilled from the inventory of the player, the lot will get typed. \n\nBuildings are activated and inactivated at game ticks, so the newly built building will have its first activation check on the next game tick. Note that several building types have preconditions in order to become active, or boost each other for being within influence range of favorable building types.",
        "image": "Tutorial/tutorial_basic_ui_landpurchase.png"
      },
      {
        "name": "Building sculpting",
        "text": "Typed buildings can also be built aesthetically. Note that buildings do not require the voxel-based building aesthetics in order to function, but lots will require a minimum set of materials even if they have been typed but have not had their voxels placed. Aesthetical buildinging is encouraged, even beyond the minimum limits of required materials for a building type. \n\nSome default key bindings essential for aesthetical building are\n-Q and E for adding or removing individual voxels\n-Z and C for adding or removing voxels at current selection\n-X for material selection, with horizontal for different materials and vertical for variations in material textures. \n\nAfter the building is ready, player ought to press Approve-button to send the planned building to be mined into the blockchain as horizontal slices. These voxel-based buildings can be imported and exported in VOX format for user convenience; for example, trees and other replicated assets are easiest to build when imported.",
        "image": "Tutorial/tutorial_basic_ui_landsculpting.png"
      }
    ]
  },
  {
    "name": "basic_ui_terrain",
    "trigger": "ui_terrain",
    "title": "Map terrain",
    "pages": [
      {
        "name": "",
        "text": "",
        "image": ""
      },
      {
        "name": "",
        "text": "",
        "image": ""
      }
    ]
  },
  {
    "name": "basic_ui_flag",
    "trigger": "ui_flag",
    "title": "Lots and flags",
    "pages": [
      {
        "name": "",
        "text": "",
        "image": ""
      },
      {
        "name": "",
        "text": "",
        "image": ""
      }
    ]
  },
  {
    "name": "basic_ui_city",
    "trigger": "ui_city",
    "title": "Cities in Townforge",
    "pages": [
      {
        "name": "Cities",
        "text": "",
        "image": ""
      },
      {
        "name": "Specializations",
        "text": "",
        "image": ""
      },
      {
        "name": "Mayor",
        "text": "",
        "image": ""
      },
      {
        "name": "Random events",
        "text": "",
        "image": ""
      },
      {
        "name": "City treasury",
        "text": "",
        "image": ""
      }
    ]
  },
  {
    "name": "advanced_time",
    "trigger": "na_trigger_",
    "title": "Time in Townforge",
    "pages": [
      {
        "name": "Connection to real time",
        "text": "",
        "image": ""
      },
      {
        "name": "Individual block progression",
        "text": "",
        "image": ""
      },
      {
        "name": "Game tick progression",
        "text": "",
        "image": ""
      },
      {
        "name": "Years and runic cycles",
        "text": "",
        "image": ""
      }
    ]
  },  
  {
    "name": "advanced_survivalism",
    "trigger": "na_trigger_",
    "title": "Survivalism and upkeep",
    "pages": [
      {
        "name": "Food",
        "text": "",
        "image": ""
      },
      {
        "name": "Crop cycle",
        "text": "",
        "image": ""
      },
      {
        "name": "Agricultural building type",
        "text": "",
        "image": ""
      },      
      {
        "name": "Vegetables",
        "text": "",
        "image": ""
      },
      {
        "name": "Grain",
        "text": "",
        "image": ""
      },   
      {
        "name": "Sowing",
        "text": "",
        "image": ""
      },   
      {
        "name": "Harvesting",
        "text": "",
        "image": ""
      },   
      {
        "name": "Meat and salted meat",
        "text": "",
        "image": ""
      },   
      {
        "name": "Moose and bear populations",
        "text": "",
        "image": ""
      },     
      {
        "name": "Food spoilage",
        "text": "",
        "image": ""
      },
      {
        "name": "Food points",
        "text": "",
        "image": ""
      },       
      {
        "name": "Warmth",
        "text": "",
        "image": ""
      },
      {
        "name": "Sources of firewood",
        "text": "",
        "image": ""
      },
      {
        "name": "Heating points",
        "text": "",
        "image": ""
      },      
      {
        "name": "Wood chopping",
        "text": "",
        "image": ""
      },
      {
        "name": "Temperature and geothermal heating",
        "text": "",
        "image": ""
      },
      {
        "name": "Other upkeep consumables such as labour",
        "text": "",
        "image": ""
      },
      {
        "name": "Stability and building decay",
        "text": "",
        "image": ""
      },
      {
        "name": "Increased expenses for unused land",
        "text": "",
        "image": ""
      }
    ]
  },   
  {
    "name": "advanced_mechanics",
    "trigger": "na_trigger_",
    "title": "Additional mechanics",
    "pages": [
      {
        "name": "Research",
        "text": "",
        "image": ""
      },
      {
        "name": "Lot size limitations",
        "text": "",
        "image": ""
      },
      {
        "name": "Economical power",
        "text": "",
        "image": ""
      },
      {
        "name": "Wood production",
        "text": "",
        "image": ""
      },
      {
        "name": "Stone production",
        "text": "",
        "image": ""
      },
      {
        "name": "Gemstones",
        "text": "",
        "image": ""
      },
      {
        "name": "Labour production",
        "text": "",
        "image": ""
      },
      {
        "name": "Invitation codes and discounts",
        "text": "",
        "image": ""
      }   
    ]
  },   
  {
    "name": "advanced_communication",
    "trigger": "na_trigger_",
    "title": "Communication",
    "pages": [
      {
        "name": "In-game chat",
        "text": "",
        "image": ""
      },
      {
        "name": "IRC",
        "text": "",
        "image": ""
      },
      {
        "name": "Forums and official website",
        "text": "",
        "image": ""
      },
      {
        "name": "Wiki, Twitter and Reddit",
        "text": "",
        "image": ""
      },
      {
        "name": "Other sources",
        "text": "",
        "image": ""
      }
    ]
  },   
  {
    "name": "advanced_rpg",
    "trigger": "na_trigger_",
    "title": "RPG elements",
    "pages": [
      {
        "name": "Levels",
        "text": "",
        "image": ""
      },
      {
        "name": "Attributes",
        "text": "",
        "image": ""
      },
      {
        "name": "Badges",
        "text": "",
        "image": ""
      },
      {
        "name": "TF scripting",
        "text": "",
        "image": ""
      },
      {
        "name": "Live events",
        "text": "",
        "image": ""
      }
    ]
  },
  {
    "name": "advanced_economy",
    "trigger": "na_trigger_",
    "title": "Economy model in Townforge",
    "pages": [
      {
        "name": "Trade deals",
        "text": "",
        "image": ""
      },      
      {
        "name": "Infinite supply",
        "text": "",
        "image": ""
      },      
      {
        "name": "Land purchases and taxation",
        "text": "",
        "image": ""
      },      
      {
        "name": "Shares",
        "text": "",
        "image": ""
      },
      {
        "name": "Dev fund",
        "text": "",
        "image": ""
      },
      {
        "name": "Prestige payouts",
        "text": "",
        "image": ""
      },
      {
        "name": "Minting and smelting",
        "text": "",
        "image": ""
      },
      {
        "name": "Auctions",
        "text": "",
        "image": ""
      },
      {
        "name": "Dividends",
        "text": "",
        "image": ""
      },      
      {
        "name": "Mortgages",
        "text": "",
        "image": ""
      },      
      {
        "name": "Dev fund",
        "text": "",
        "image": ""
      },
      {
        "name": "Monetization",
        "text": "",
        "image": ""
      }
    ]
  },
  {
    "name": "advanced_items",
    "trigger": "na_trigger_",
    "title": "Items",
    "pages": [
      {
        "name": "Hard-coded items",
        "text": "",
        "image": ""
      },
      {
        "name": "Custom items generated by game",
        "text": "",
        "image": ""
      },
      {
        "name": "Custom items by players",
        "text": "",
        "image": ""
      },
      {
        "name": "IPFS",
        "text": "",
        "image": ""
      },
      {
        "name": "Embedded TFG and recovery",
        "text": "",
        "image": ""
      }
    ]
  },
  {
    "name": "advanced_building",
    "trigger": "na_trigger_",
    "title": "Building mechanics",
    "pages": [
      {
        "name": "Lot typing",
        "text": "",
        "image": ""
      },
      {
        "name": "Activation and deactivation",
        "text": "",
        "image": ""
      },
      {
        "name": "Influence range",
        "text": "",
        "image": ""
      },
      {
        "name": "Bonuses and penalties to shares",
        "text": "",
        "image": ""
      },
      {
        "name": "Non-share generating lot types",
        "text": "",
        "image": ""
      },
      {
        "name": "Boosts from tech and city specializations",
        "text": "",
        "image": ""
      },
      {
        "name": "Repair and demolition",
        "text": "",
        "image": ""
      }
    ]
  },
  {
    "name": "advanced_aesthetics",
    "trigger": "na_trigger_",
    "title": "Aesthetical building",
    "pages": [
      {
        "name": "Selection tools",
        "text": "",
        "image": ""
      },
      {
        "name": "Keybindings and mouse",
        "text": "",
        "image": ""
      },
      {
        "name": "Importing and exporting VOX",
        "text": "",
        "image": ""
      },
      {
        "name": "Assigning additional items",
        "text": "",
        "image": ""
      },
      {
        "name": "Unlocking and changing materials",
        "text": "",
        "image": ""
      }
    ]
  },
  {
    "name": "advanced_helpers",
    "trigger": "na_trigger_",
    "title": "Survivalism and upkeep",
    "pages": [
      {
        "name": "Default ignore mechanics",
        "text": "",
        "image": ""
      },
      {
        "name": "GM rights",
        "text": "",
        "image": ""
      },
      {
        "name": "Updating names and items",
        "text": "",
        "image": ""
      },
      {
        "name": "Leaderboards",
        "text": "",
        "image": ""
      },
      {
        "name": "Visibility for in-game and out-game transactions",
        "text": "",
        "image": ""
      }
    ]
  }
]
